#### WoodParallelCompressionStrength Property

---

|  |
| --- |
| StructuralAsset Class   See Also |

The parallel compression strength of the asset.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double WoodParallelCompressionStrength { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property WoodParallelCompressionStrength As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double WoodParallelCompressionStrength { 	double get (); 	void set (double value); } ``` |

# Remarks

Applies to wood-based structural assets. The value is in Newtons per foot meter (N/(ft Â· m)).

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InapplicableDataException | When setting this property: the material type must be wood to set this property. |

# See Also

StructuralAsset Class

Autodesk.Revit.DB Namespace